%----------使用分子分母表示传递函数-------------
% num = [1 2]; %分子多项式
% den = [1 2 1]; %分母多项式
% sys = tf(num,den) %传递函数 


%----------使用极值点，零点及增益表示传递函数-------------
% Z = [-2];
% P = [-1 -3];
% K = [0.5];
% sys = zpk(Z,P,K)


%----------将零，极点形式转变为传统分子分母形式-------------
% [num,den] = zp2tf(Z,P,K);
% sys = tf(num,den)



%----------------串联系统---------------------
% G1 = tf(1,[1 2 1]);
% G2 = tf(1,[1,2]);
% sys = series(G1,G2)


%----------------并联系统---------------------
% sys = parallel(G1,G2)


%----------------带反馈连接---------------------
G = tf(1,[1 2 1]);
H = tf(1,[1 1]);
sys = feedback(G,H)
